## Production: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 9 to add, 2 to change, 9 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.wordpress_ecs_task_get_secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "wordpress_ecs_task_get_secret_value"  {
      ~ id      = "4231974823" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j",
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7",
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S",
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx",
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54",
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM",
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7",
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv",
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
                # (11 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.wordpress_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "wordpress_container_definition"  {
      ~ id       = "a6ee4774441c0fcc15aa3a503d782200ae66f1dc08b2c3833f0c047e6e42ecde" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.19"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - name             = "apache"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [
                      - {
                          - readOnly        = true
                          - sourceContainer = "wordpress"
                        },
                    ]
                },
              - {
                  - environment      = [
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.alpha.canada.ca"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.alpha.canada.ca');define('WP_SITEURL','https://articles.alpha.canada.ca');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v2.8.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 9000
                          - hostPort      = 9000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "DEFAULT_NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD"
                        },
                      - {
                          - name      = "S3_UPLOADS_BUCKET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "S3_UPLOADS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3"
                        },
                      - {
                          - name      = "S3_UPLOADS_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "WORDPRESS_AUTH_KEY"           = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j" -> (known after apply)
          ~ "WORDPRESS_AUTH_SALT"          = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7" -> (known after apply)
          ~ "WORDPRESS_LOGGED_IN_KEY"      = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S" -> (known after apply)
          ~ "WORDPRESS_LOGGED_IN_SALT"     = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx" -> (known after apply)
          ~ "WORDPRESS_NONCE_KEY"          = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54" -> (known after apply)
          ~ "WORDPRESS_NONCE_SALT"         = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM" -> (known after apply)
          ~ "WORDPRESS_SECURE_AUTH_KEY"    = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7" -> (known after apply)
          ~ "WORDPRESS_SECURE_AUTH_SALT"   = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv" -> (known after apply)
            # (19 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:472286471787:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress:1" -> (known after apply)
        # (14 unchanged attributes hidden)





      + ordered_placement_strategy {
          + field = "attribute:ecs.availability-zone"
          + type  = "spread"
        }
        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.19"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "apache"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [
                      - {
                          - readOnly        = true
                          - sourceContainer = "wordpress"
                        },
                    ]
                },
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.alpha.canada.ca"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.alpha.canada.ca');define('WP_SITEURL','https://articles.alpha.canada.ca');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v2.8.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 9000
                          - hostPort      = 9000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "DEFAULT_NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD"
                        },
                      - {
                          - name      = "S3_UPLOADS_BUCKET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "S3_UPLOADS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3"
                        },
                      - {
                          - name      = "S3_UPLOADS_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.wordpress_ecs_task_get_secret_value will be updated in-place
  ~ resource "aws_iam_policy" "wordpress_ecs_task_get_secret_value" {
        id        = "arn:aws:iam::472286471787:policy/WordpressEcsTaskGetSecretValue"
        name      = "WordpressEcsTaskGetSecretValue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.wordpress_auth_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "wordpress_auth_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j|0E43D4A4-7551-4813-AE50-46D5DFDA832C" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "0E43D4A4-7551-4813-AE50-46D5DFDA832C" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.wordpress_auth_salt must be replaced
-/+ resource "aws_secretsmanager_secret_version" "wordpress_auth_salt" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7|9EF7218E-86E6-43F9-A304-653EC0DFA3AB" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "9EF7218E-86E6-43F9-A304-653EC0DFA3AB" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.wordpress_logged_in_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "wordpress_logged_in_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S|ACE9125B-2586-4BF9-A4CA-ADAA0386ABEA" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "ACE9125B-2586-4BF9-A4CA-ADAA0386ABEA" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.wordpress_logged_in_salt must be replaced
-/+ resource "aws_secretsmanager_secret_version" "wordpress_logged_in_salt" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx|AFC28AC9-BF6B-4B9E-AEBB-BBF6390F908C" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "AFC28AC9-BF6B-4B9E-AEBB-BBF6390F908C" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.wordpress_nonce_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "wordpress_nonce_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54|89E5EFFA-A73A-4A66-A57E-7F2C4CE1521F" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "89E5EFFA-A73A-4A66-A57E-7F2C4CE1521F" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.wordpress_nonce_salt must be replaced
-/+ resource "aws_secretsmanager_secret_version" "wordpress_nonce_salt" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM|8980A7DB-FF99-4E10-BD00-D000EB8C0D63" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "8980A7DB-FF99-4E10-BD00-D000EB8C0D63" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.wordpress_secure_auth_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "wordpress_secure_auth_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7|4FEFF488-CC6E-4B3A-A524-0BEEF3D744E9" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "4FEFF488-CC6E-4B3A-A524-0BEEF3D744E9" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.wordpress_secure_auth_salt must be replaced
-/+ resource "aws_secretsmanager_secret_version" "wordpress_secure_auth_salt" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv|D2C3E151-F936-492E-8EFE-D03B8CDBC0DF" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "D2C3E151-F936-492E-8EFE-D03B8CDBC0DF" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 9 to add, 2 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>